-- phpMyAdmin SQL Dump
-- version 4.7.9
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 21, 2019 at 10:40 AM
-- Server version: 10.1.31-MariaDB
-- PHP Version: 5.6.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `order_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `custdetail`
--

CREATE TABLE `custdetail` (
  `custID` int(2) UNSIGNED NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `address` varchar(200) DEFAULT NULL,
  `tel` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `custdetail`
--

INSERT INTO `custdetail` (`custID`, `name`, `address`, `tel`) VALUES
(1, 'คลังความรู้', '18/18 บางนา บางนา กรุงเทพ 10260', '0-2337-0361'),
(2, 'ห้องสมุดวิทยาลัยเซนต์จอห์น', '100/6 ถ.พุทธมณฑล สาย 2 บางระนาด ตลิ่งชัน กทม.', '(662) 332-6503'),
(3, 'บริษัท คู่แข่ง จำกัด (มหาชน)', 'ชั้นG ศูนย์การค้า The Mall เพชรเกษม- บางแค เลขที่275 หมู่1 ถ.เพชรเกษม บางแคเหนือ ภาษีเจริญ กทม', '02-240-3700\''),
(4, 'ร้าน ลาบัส', '1770 ถ.เพชรบุรีตัดใหม่ ห้วยขวาง  กทม.', '(662) 537-2000'),
(5, 'NORTHBRIDGE COMMUNITIES LTD.', '69/428 หมู่ 8 ถ.รัตนาธิเบศร์ บางกระสอ อ.เมือง นนทบุรี', '276-1040'),
(6, 'รศ. กนิษฐา นาวารัตน์', 'อาคารบุญผ่อง ชั้น 18 1193  ถ.พหลโยธิน พญาไท  กทม.', '(662) 561-1036'),
(7, 'บริษัท เดอะบุ๊คเชสท์ จำกัด', '\"เลขที่ 2199, 2201, 2203, 2205, 2207 ถ. ลาดพร้าว  แขวงวังทองหลาง บางกะปิ   กรุงเทพ\"', '2203'),
(8, 'โรงเรียน บ้านภาษา & คอมพิวเตอร์', 'อาคารชาญอิสระทาวเวอร์ 2 ชั้น 1 2922/209  ถ.เพชรบุรีตัดใหม่ บางกะปิ  กทม', '(662) 512-2271-3'),
(9, 'บริษัท ซีอาร์ชวรัตน์ จำกัด', 'อาคารสินธร  ชั้น 10 132  ถ.วิทยุ  ปทุมวัน กรุงเทพฯ', '(662) 521-0368'),
(10, 'USAID', '\"159/30 Vibhavadi Rangsit Rd., Donmuang  Bangkok\"', ''),
(11, 'CHA CHA RESTAURANT', '372 ถ.สาธุประดิษฐ์ บางโพงพาง ยานนาวา กรุงเทพฯ', '392-2683'),
(12, 'Amity Bookstore The President Park', '\"The President Park, Park View  99/361-368 Sukhumvit 24  Bangkok\"', ''),
(13, 'Books & Magazine Co.Ltd.', '604/3 อาคารพันธ์ทิพย์พลาซ่า ถ.เพชรบุรี เขตราชเทวี กทม.', ''),
(14, 'บริษัท โตชิบา ไทยแลนด์ จำกัด', '60 Soi Naphasup Yaek 5 Sukhumvit 36 Bangkok', '527-4387'),
(15, 'บริษัท ซีเกทเทคโนโลยี จำกัด', 'ชั้นG  ศูนย์การค้า The Mall ลาดพร้าว- บางกะปิ เลขที่ 3522 ถ.ลาดพร้าว คลองจั่น บางกะปิ กทม.', '240-2865'),
(16, 'International Education Institute', '525/1 สีลม ซ.9 สีลม บางรัก กทม.', '466-0519'),
(17, 'Dr. Sawitree Bintasan', '60 / 14 ม. 11 ถ. บางนา - ตราด  บางนา พระโขนง กทม', '466-0519'),
(18, 'บริษัทเงินทุนหลักทรัพย์ มหาสมุทร จำกัด', 'โรงแรมมณเฑียร 54 ถ.สุรวงศ์ สี่พระยา บางรัก กทม.', '466-0519'),
(19, 'LOXLEY PUBLIC CO.,LTD.\"', '70/15 คูคด ลำลูกกา ปทุมธานี', ''),
(20, 'Interkids', 'อาคารบางกอกโพสต์ 136  ถ.ณ ระนอง แยกสุนทรโกษา คลองเตย กรุงเทพฯ', '643-1111'),
(21, 'โรงเรียนอนุบาลพิรินทร', 'บริษัท ซัคเซส มีเดีย จำกัด 87/110 ชั้น 14 อาคารโมเดอร์นทา คลองเตย  กทม', '255-7500-8'),
(22, 'EDUCARE 2', '15/1 สุขุมวิท 33 กทม.', '2112710'),
(23, 'โรงเรียนเสริมทักษะสาริมาน', '2102 ซ.ทวีวัฒนา ถ.จันทน์ ช่องนนทรี ยานนาวา กทม.', '152-249051'),
(24, 'โรงเรียนอนุบาลแย้มสะอาด', '87/110 อาคารโมเดอร์นทาวน์ ชั้น คลองตัน คลองเตย กรุงเทพฯ', '381-4220'),
(25, 'บริษัท อุดมศาสตร์ จำกัด', '\"เลขที่ 2199, 2201, 2203, 2205,2207 ถ. ลาดพร้าว  แขวงวังทองหลาง บางกะปิ  กรุงเทพ\"', '2203'),
(26, 'ร้านหนังสือ สุธิดา บุ๊ค', 'เพลินจิต ทาวเวอร์ ชั้น 18 898 ถ.เพลินจิต ลุมพินี ปทุมวัน กทม.', '2516334'),
(27, 'บริษัท เค ที โอ (1993) จำกัด', '87/110 อาคารโมเดอร์นทาวน์ ชั้น สุขุมวิท 63  กทม.', '(074)364620'),
(28, 'โรงเรียนพัฒนาเด็ก', '\"Hilton Hotel 2 Wireless Road,  Pathumwan Bangkok\"', ''),
(29, 'ห้างหุ้นส่วนจำกัด วรสาส์น', 'อาคารสินธร ชั้น 11', '331-2564'),
(30, 'อนุบาลมณีรัตน์', 'อาคารโมเดอร์นทาวน์ ชั้น 14 87/110 สุขุมวิท 63 คลองตัน คลองเตย กทม.', '509-0214'),
(31, 'Good Choice Supermarket', '79 ซ.รามคำแหง 50 หัวหมาก  กรุงเทพฯ', '314-4024'),
(32, 'ร้านทองแสง', '23/34-35 ถ.ตรีมิตร สัมพันธวงศ์  กรุงเทพฯ', '275-2350'),
(33, 'ร้านหนังสือ ร.พ. มิชชั่น', '44 ม.10 บางนาตราด (กม 4.5) พระโขนง  กรุงเทพฯ', '221-7765'),
(34, 'ไมโคร บุ๊ค เซ็นเตอร์', '112/54 ม.2 ถ.เอกชัย แขวงบางขุนเทียน เขตจอมทอง กทม.', '258-4181'),
(35, 'ร้าน BOOK SHELF', 'BANGKOK BANK', '(056)424-274'),
(36, 'บริษัท สยามแฟมิลี่มาร์ท จำกัด', 'มหาวิทยาลัยสยาม 235 ถ.เพชรเกษม บางหว้า ภาษีเจริญ กทม.', '(056) 313408'),
(37, 'บริษัท ดวงกมลสมัย จำกัด (สายส่ง)', '1259 ถ.วิเชียรโชฎก มหาชัย เมือง สมุทรสาคร', '(053)731-274'),
(38, 'บริษัท ซี.พี เซเว่นอีเลฟเว่น จำกัด', 'อาคารโฮปเพลส', '645-2630-42'),
(39, 'ร้านประสิทธิ์ศิลป์บุ๊คเซ็นเตอร์', '\"ชั้นใต้ดิน ห้องเลขที่ 98-104 อาคารฟอร์จูนทาวน์, เลขที่ 5 ถ.รัชดาภิเษก ห้วยขวาง  กทม.\"', ''),
(40, 'สำนักหอสมุดกลาง มหาวิทยาาลัยศรีปทุม', 'ธนาคารกรุงเทพ จำกัด (สำนักงานใ 333 ถ.สีลม สีลม บางรัก กรุงเทพฯ', '381-4220'),
(41, 'ห้างหุ้นส่วนจำกัด บาซาร์', '682/4 Sukhumvit Road Bangkok', '9349301-12'),
(42, 'SUMMIT CO.,LTD.\"', 'สุขาภิบาล 2 บางกะปิ กรุงเทพฯ', ''),
(43, 'NORSK DATA LIMITED.', 'ชั้น 7 ห้างเซ็นทรัลชิดลม 1027 ถ.ชิดลม-เพลินจิต  กทม.', '01-9790260'),
(44, 'ร้านเสรีบุ๊คส์', '2922/60 ถ.เพชรบุรีตัดใหม่ บางกะปิ ห้วยขวาง กทม.', '038-791538'),
(45, 'บริษัท กระดาษสหไทย จำกัด(มหาชน)', 'ต.คลอง 1 อ.คลองหลวง  ปทุมธานี', '045-687-062'),
(46, 'ร้านศูนย์หนังสือจันทบุรี', '63-64 อาคารไทวา 1 ชั้น 1 สาธรใต้ กทม.', '721-9355'),
(47, 'บริษัท เมคคาไดน์ คอร์ปอเรชั่น จำกัด', '12 ซ.รามคำแหง 14 ถ.รามคำแหง หัวหมาก บางกะปิ  กทม.', '7476118-19'),
(48, 'บริษัท ส.เอซียเพรส (1989) จำกัด', 'เลขที่ 161 หมู่ที่ 2 อาคารศูนย์การค้า ฟิวเจอร์ พาร์ค รังสิต ห้องเลขที่ 135R ชั้น 1 ประชาธิปัตย์ ธัญบุรี ปทุมธานี', '247-1030'),
(49, 'บริษัท ดาต้า ไอที ซุปเปอร์สโตร์ จำกัด', '212/229 ประเวศ พระโขนง กทม', '631-0231'),
(50, 'METRABYTE CO.', '115   ชั้น 1  ธนิยะพลาซ่า  สีลม  กรุงเทพฯ', ''),
(51, 'บริษัท คอมเพลซ คอนซัลติ้ง จำกัด', '17 ซ.ศูนย์วิจัย 3 ถ.เพชรบุรีตั  ห้วยขวาง กทม', '5800050-69'),
(53, 'ร้าน KIDDY WORLD', 'ห้องเลขที่ 319 อาคารโรงแรมและอุทยาน การค้ากาดสวนแก้ว  99/4 หมู่ 2 ถ.ห้วยแก้ว ต.สุเทพ อ.เมือง เชียงใหม่', '248-1161'),
(54, 'บริษัท จีเนียส คอมพิวเตอร์ จำกัด', '252/40 อาคารเมืองไทยภัทร 1 ชั้น 31 ถ.รัชดาภิเษก  ห้วยขวาง กทม.', '039-312851'),
(55, 'INCHCAPE SERVICES LIMITED', '37 ซ.สุขุมวิท 35 คลองเตย คลองเตย กทม', '561-1036'),
(56, 'SDK', '888 ekamai Sukhumvit Bangkok 10110', '02888888'),
(57, 'สาระดี', '897 อ่อนนุช160 อ่อนนุช พระโขนง กรุงเทพ 10200', '029999999'),
(58, 'คลังความรู้', '8589 ถ.สุขุมวิท 63 คลองตันเหนือ วัฒนา กรุงเทพฯ 10110', '02-456-7890');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `custdetail`
--
ALTER TABLE `custdetail`
  ADD PRIMARY KEY (`custID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `custdetail`
--
ALTER TABLE `custdetail`
  MODIFY `custID` int(2) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
